rice-slop.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-01-15 Wed 18:14 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>rice slop</title>
<meta name="generator" content="Org Mode" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png">
<link rel="apple-touch-icon" sizes="180x180" href="./apple-touch-icon.png">
<link rel="icon" type="image/png" sizes="32x32" href="./favicon-32x32.png">
<link rel="icon" type="image/png" sizes="16x16" href="./favicon-16x16.png">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:title" content="rice slop">
<meta property="og:description" content="food maxxing">
<meta property="og:image" content="https://notes.neeasade.net/assets/img/backgrounds/newfeather.png">
<meta property="og:url" content="https://notes.neeasade.net/rice-slop.html">
<meta property="description" content="food maxxing">
<meta name="twitter:card" content="summary">
<link rel='stylesheet' href='/assets/css/colors.css?sum=cf5c1e307b1a05a43b93e7a2aa38b0db'>
<link rel='stylesheet' href='./assets/css/colors.css?sum=cf5c1e307b1a05a43b93e7a2aa38b0db'>
<link rel='stylesheet' href='/assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='./assets/css/new.css?sum=8ded96c4e22d9cf406740e90fb2c41de'>
<link rel='stylesheet' href='/assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='./assets/css/org.css?sum=6f5b128ae2001f1230d4fdc21163a4d6'>
<link rel='stylesheet' href='/assets/css/notes.css?sum=61d22dc2718593df58ba630cc1cdf0a6'>
<link rel='stylesheet' href='./assets/css/notes.css?sum=61d22dc2718593df58ba630cc1cdf0a6'>
</head>
<body>
<div id="content" class="content">
<div style="float: left">
    <a href='/index.html'>../🌳ＧＲＯＶＥ🌳</a>
</div>

<div style="float: right">
    
    <a href="https://raw.githubusercontent.com/neeasade/neeasade.github.io/source/posts/rice-slop.org">source</a>
</div>
<h1 class=title>rice slop</h1>
<div class="org-center">
<p>
food maxxing
</p>
</div>
<div class=pubinfo>
Published 2024-10-25, last edit <a href="https://github.com/neeasade/neeasade.github.io/commits/source/posts/rice-slop.org">2024-10-25</a>
</div>
<hr>
<p>
For a little over a year now, I have been increasingly obsessed with a meal I
have lovingly termed &ldquo;rice slop&rdquo;. A friend asked me to write some of the process
down, so here we are.
</p>

<p>
The beauty of rice slop is almost none of the measurements are precise, you can
just toss in the ingredients and hit the &ldquo;cook&rdquo; button and then BAM you are set
for a meal or 5 depending on the size of your rice cooker and ingredients.
</p>

<p>
Rice slop is made in a rice cooker, with different layers of ingredients. There
are typically 3 layers, like so:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">Layer</td>
<td class="org-left">Notes</td>
</tr>

<tr>
<td class="org-left">rice (bottom)</td>
<td class="org-left">Jasmine rice + various sauces</td>
</tr>

<tr>
<td class="org-left">meat (middle)</td>
<td class="org-left">pre cooked chicken or tuna</td>
</tr>

<tr>
<td class="org-left">veggies n beans (top)</td>
<td class="org-left">frozen or canned vegetables, pinto beans</td>
</tr>
</tbody>
</table>
<div id="outline-container-Layer-1-(rice)" class="outline-2">
<h2 id="Layer-1-(rice)"><span class="section-number-2">1.</span> Layer 1 (rice) <span class=anchor><a href="#Layer-1-(rice)">#</a></span></h2>
<div class="outline-text-2" id="text-Layer-1-(rice)">
<p>
I usually use jasmin rice, using 1 <a href="https://en.wikipedia.org/wiki/Ge_(unit)">Ge</a> for a smaller batch, or 2 for a larger one.
</p>

<p>
Rinse the rice in a strainer (or sifter) and then place jasmine rice and water in a 1:1 ratio in the rice cooker bowl.
</p>

<p>
Now for the fun part - mix in any of the following for flavor:
</p>

<ul class="org-ul">
<li>chicken bouillon cube</li>
<li>hot sauce (I usually use sriracha)</li>
<li>garlic cloves</li>
<li>chili crisp</li>
<li>sesame seed oil (just a few drops)</li>
<li>soy sauce</li>
<li>teriyaki sauce</li>
<li>oyster sauce</li>
<li>salsa</li>
</ul>

<p>
Basically any misc sauce or seasoning that your curious about can be thrown in
at this stage. I&rsquo;ll put it this way, I&rsquo;ve never over seasoned my rice slop. If
you want to keep it simple, maybe start with just salsa?
</p>

<p>
Mix ingredients together and you&rsquo;re done with layer one 😎
</p>
</div>
</div>
<div id="outline-container-Layer-2-(meat)" class="outline-2">
<h2 id="Layer-2-(meat)"><span class="section-number-2">2.</span> Layer 2 (meat) <span class=anchor><a href="#Layer-2-(meat)">#</a></span></h2>
<div class="outline-text-2" id="text-Layer-2-(meat)">
<p>
I usually use precooked grilled chicken from the grocery store. A can of tuna
(drained first) works nicely as well. Just lay it on top of the rice + sauce
mixture (<b>no mixing</b>).
</p>
</div>
</div>
<div id="outline-container-Layer-3-(veggies-n-beans)" class="outline-2">
<h2 id="Layer-3-(veggies-n-beans)"><span class="section-number-2">3.</span> Layer 3 (veggies n beans) <span class=anchor><a href="#Layer-3-(veggies-n-beans)">#</a></span></h2>
<div class="outline-text-2" id="text-Layer-3-(veggies-n-beans)">
<p>
I usually use a frozen or canned vegetable pack for this stage, just lay them on
top of the meat. Do the same with a can of pinto beans.
</p>

<p>
Hit the cook button and you are DONE (mix together layers after the rice cooker button pops)
</p>
</div>
</div>
<div id="outline-container-Streamlined-example:-tuna-slop" class="outline-2">
<h2 id="Streamlined-example:-tuna-slop"><span class="section-number-2">4.</span> Streamlined example: tuna slop <span class=anchor><a href="#Streamlined-example:-tuna-slop">#</a></span></h2>
<div class="outline-text-2" id="text-Streamlined-example:-tuna-slop">
<p>
Ingredients:
</p>

<ul class="org-ul">
<li>1/2 cup of jasmine rice</li>
<li>1/2 cup of water</li>
<li>soy sauce</li>
<li>a can of tuna</li>
<li>stir fry vegetable mix (or asian mix, or whatever sticks out to you)</li>
<li>(optional) 1 can pinto beans</li>
</ul>

<p>
howto:
</p>

<ul class="org-ul">
<li>Place rice and water in rice cooker.</li>
<li>Add a shit ton of soy sauce, mix</li>
<li>Drain tuna can, throw on top</li>
<li>Throw veggies and optionally beans in there</li>
<li>Hit the cook button, and wait for your savory bowl</li>
</ul>

<div class="footer-center">
    
</div>
</div>
</div>
</div>
</body>
</html>
